app/views/chatrooms/show.html.erb

<p>
  <% if @chatroom.messages.any? %>
---
SELECT  1 AS one FROM "messages" WHERE "messages"."chatroom_id" = ? LIMIT ?  [["chatroom_id", 1], ["LIMIT", 1]]