app/controllers/chatrooms_controller.rb

SELECT "chatrooms".* FROM "chatrooms"
---
  def index
    @chatrooms = Chatroom.all

INSERT INTO "chatrooms" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Chatroom1"], ["created_at", 2016-08-10 04:36:55 UTC], ["updated_at", 2016-08-10 04:36:55 UTC]]
---
  def create
    @chatroom = Chatroom.new(chatroom_params)

    respond_to do |format|
      if @chatroom.save

SELECT  "chatrooms".* FROM "chatrooms" WHERE "chatrooms"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_chatroom
      @chatroom = Chatroom.find(params[:id])