app/controllers/messages_controller.rb

INSERT INTO "messages" ("content", "username", "chatroom_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "message 1 from user1"], ["username", "user1"], ["chatroom_id", 1], ["created_at", 2016-08-10 04:46:15 UTC], ["updated_at", 2016-08-10 04:46:15 UTC]]
---
  def create
    @message = Message.new(message_params)

    if @message.save